In [2]:
import pandas as pd
import numpy as np

read_csv() Method

In [58]:
salariesDf = pd.read_csv('../data/salaries.csv', header=0, skiprows=[1])
salariesDf.set_index('playerID', inplace=True)
salariesDf

           yearID teamID lgID    salary
playerID
bedrost01    1985    ATL   NL    550000
benedbr01    1985    ATL   NL    545000
campri01     1985    ATL   NL    633333
ceronri01    1985    ATL   NL    625000
chambch01    1985    ATL   NL    800000
...           ...    ...  ...       ...
treinbl01    2015    WAS   NL    512800
ugglada01    2015    WAS   NL    507500
werthja01    2015    WAS   NL  21000000
zimmejo02    2015    WAS   NL  16500000
zimmery01    2015    WAS   NL  14000000

[25574 rows x 4 columns]

Indexing and Selecting Data

In [62]:
condition = (salariesDf['teamID'].isin(['ATL', 'HOU'])) & (salariesDf['salary'] > 1000000)
filtered_data = salariesDf.loc[condition].index

print(filtered_data)

Index(['hornebo01', 'murphda05', 'suttebr01', 'ryanno01', 'hornebo01',
       'murphda05', 'suttebr01', 'ryanno01', 'griffke01', 'murphda05',
       ...
       'feldmsc01', 'gonzama01', 'gregelu01', 'lowrije01', 'neshepa01',
       'quallch01', 'rasmuco01', 'singljo02', 'sippto01', 'valbulu01'],
      dtype='object', name='playerID', length=595)

In [77]:
condition = (salariesDf['teamID'] == 'ATL')
teamATL_data = salariesDf.loc[condition]
#print( teamATL_data['salary'].describe() )

mean = teamATL_data['salary'].describe()['mean']
maximum = teamATL_data['salary'].describe()['max']
minimum = teamATL_data['salary'].describe()['min']

quartile_1 = teamATL_data['salary'].describe()['25%']
median = teamATL_data['salary'].describe()['50%']
quartile_3 = teamATL_data['salary'].describe()['75%']

std_dev = teamATL_data['salary'].describe()['std']

'''print(mean)
print(maximum)
print(minimum)
print(quartile_1)
print(median)
print(quartile_3)
print(std_dev)'''

'print(mean)\nprint(maximum)\nprint(minimum)\nprint(quartile_1)\nprint(median)\nprint(quartile_3)\nprint(std_dev)'

In [110]:
dic = {'yearID': [], 'teamID': [], 'lgID': [], 'salary': []}

indexName = salariesDf.index.name

#creating empty dictionary with header values
dic[indexName] = []
for columnName in salariesDf.columns.tolist():
    dic[columnName] = []

#filling data using iterrows()
for row in salariesDf.iterrows():
    dic[indexName].append(row[0])
    
    for columnName in salariesDf.columns.tolist():
        dic[columnName].append(row[1][columnName])

In [121]:
pd.DataFrame.from_dict(dic)

       yearID teamID lgID    salary   playerID
0        1985    ATL   NL    550000  bedrost01
1        1985    ATL   NL    545000  benedbr01
2        1985    ATL   NL    633333   campri01
3        1985    ATL   NL    625000  ceronri01
4        1985    ATL   NL    800000  chambch01
...       ...    ...  ...       ...        ...
25569    2015    WAS   NL    512800  treinbl01
25570    2015    WAS   NL    507500  ugglada01
25571    2015    WAS   NL  21000000  werthja01
25572    2015    WAS   NL  16500000  zimmejo02
25573    2015    WAS   NL  14000000  zimmery01

[25574 rows x 5 columns]

# Numpy

In [163]:
l1 = [ [[1,2,3], [4,5,6]], [[11,12,13],[14,15,16]] ]
l2 = [1,2,3,4,5,6]
np_arr = np.array(l1, dtype=np.float64)

print("Ndim - " + str(np_arr.ndim))
print("Shape - " + str(np_arr.shape))
print("L2 Shape - " + str(np.array(l2).shape))
print("Size - " + str(np_arr.size))
print("Item Size - " + str(np_arr.itemsize)) #gives size of an individual arrayy, say [1,2,3] in bytes
print("dtype - " + str(np_arr.dtype))

print("size - " + str(np_arr.data))

Ndim - 3
Shape - (2, 2, 3)
L2 Shape - (6,)
Size - 12
Item Size - 8
dtype - float64
size - <memory at 0x154061210>

In [162]:
l1 = [ [[1,2,3], [4,5,6]], [[11,12,13],[14,15,16]] ]
npArr = np.array(l1)
f = npArr.flatten()
x = np.reshape(npArr, (1,12))
f.shape

(12,)